In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("income.csv")

In [10]:
data.describe()
# data.columns

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [9]:
# find quantile at 0
data["Monthly Income ($)"].quantile(0)

np.float64(4000.0)

In [11]:
print(""" 
to estimate unknown values between known data points.
Instead of connecting two data points with a straight line (like in linear interpolation), 
higher-order interpolation uses multiple points and more 
advanced curves to create a smoother and more accurate estimate.
 """)

data["Monthly Income ($)"].quantile(0.25, interpolation="higher")

to estimate unknown values between known data points.
Instead of connecting two data points with a straight line (like in linear interpolation),
higher-order interpolation uses multiple points and more
advanced curves to create a smoother and more accurate estimate.

np.int64(6000)

In [12]:
data["Monthly Income ($)"].quantile(0.50, interpolation="higher")

np.int64(7000)

In [14]:
data["Monthly Income ($)"].quantile(0.75)

np.float64(7750.0)

In [15]:
data["Monthly Income ($)"].quantile(1)

np.float64(10000000.0)

In [17]:
percentile_99 = data["Monthly Income ($)"].quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [18]:
data[data["Monthly Income ($)"] > percentile_99]

        Name  Monthly Income ($)
6  Elon Musk            10000000

In [19]:
data

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [21]:
# to get more accurate result lets do some interesting coding
data["Monthly Income ($)"][3] = np.nan
data

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia                 NaN
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0

In [23]:
data["Monthly Income ($)"].mean()

np.float64(1671666.6666666667)

In [27]:
print("""
The mean is the sum of all values divided by the number of values.

Formula:
Mean
=
Sum of all values/
Number of values 
      
Mean = (5+5+8+10+12+15) / 5  =10
""")


data_fill = data.fillna(data["Monthly Income ($)"].mean())
data_fill

The mean is the sum of all values divided by the number of values.

Formula:
Mean
=
Sum of all values/
Number of values

Mean = (5+5+8+10+12+15) / 5  =10

        Name  Monthly Income ($)
0        Rob        5.000000e+03
1      Rafiq        6.000000e+03
2       Nina        4.000000e+03
3      Sofia        1.671667e+06
4      Mohan        8.000000e+03
5        Tao        7.000000e+03
6  Elon Musk        1.000000e+07

In [28]:
print("""
The median is the middle value when the data is sorted in ascending order.

If the number of values is odd, the median is the middle value.

If it's even, the median is the average of the two middle values.
""")

print("More Accurate answer")

data_fill = data.fillna(data["Monthly Income ($)"].median())
data_fill

The median is the middle value when the data is sorted in ascending order.

If the number of values is odd, the median is the middle value.

If it's even, the median is the average of the two middle values.

More Accurate answer

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia              6500.0
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0